In [1]:
import numpy as np

GKNames = ["Buerki","Hitz","Oelschlaegel","Unbehaun"]
GKHeights = [187,193,193,186] 
GKWeights = [85,86,87,82]

print(np.array(GKNames))

['Buerki' 'Hitz' 'Oelschlaegel' 'Unbehaun']

In [2]:
GKMatrix = [GKNames, GKHeights, GKWeights]
print(np.array(GKMatrix))

[['Buerki' 'Hitz' 'Oelschlaegel' 'Unbehaun']
 ['187' '193' '193' '186']
 ['85' '86' '87' '82']]

In [3]:
np.array(GKNames)
GKHeights = np.array(GKHeights)
GKHeights.max()

193

In [4]:
GKHeights.argmax()

1

In [5]:
GKNames[GKHeights.argmax()]

'Hitz'

In [6]:
import pandas as pd

df = pd.read_csv("Data Store/Refs.csv")

df.head()

,Date,HomeTeam,AwayTeam,Referee,HF,AF,TF,HY,AY,TY,HR,AR,TR
0,13/08/2016,Burnley,Swansea,J Moss,10,14,24,3,2,5,0,0,0
1,13/08/2016,Crystal Palace,West Brom,C Pawson,12,15,27,2,2,4,0,0,0
2,13/08/2016,Everton,Tottenham,M Atkinson,10,14,24,0,0,0,0,0,0
3,13/08/2016,Hull,Leicester,M Dean,8,17,25,2,2,4,0,0,0
4,13/08/2016,Man City,Sunderland,R Madley,11,14,25,1,2,3,0,0,0

In [7]:
df.columns = ['Date','HomeTeam','AwayTeam','Referee',"HomeFouls",'AwayFouls','TotalFouls','HomeYellows','AwayYellows','TotalYellows','HomeReds','AwayReds', 'TotalReds']

df.head()

,Date,HomeTeam,AwayTeam,Referee,HomeFouls,AwayFouls,TotalFouls,HomeYellows,AwayYellows,TotalYellows,HomeReds,AwayReds,TotalReds
0,13/08/2016,Burnley,Swansea,J Moss,10,14,24,3,2,5,0,0,0
1,13/08/2016,Crystal Palace,West Brom,C Pawson,12,15,27,2,2,4,0,0,0
2,13/08/2016,Everton,Tottenham,M Atkinson,10,14,24,0,0,0,0,0,0
3,13/08/2016,Hull,Leicester,M Dean,8,17,25,2,2,4,0,0,0
4,13/08/2016,Man City,Sunderland,R Madley,11,14,25,1,2,3,0,0,0

In [8]:
df.describe()

,HomeFouls,AwayFouls,TotalFouls,HomeYellows,AwayYellows,TotalYellows,HomeReds,AwayReds,TotalReds
count,380.000000,380.000000,380.000000,380.000000,380.000000,380.000000,380.000000,380.000000,380.000000
mean,11.063158,11.657895,22.721053,1.744737,1.886842,3.631579,0.055263,0.052632,0.107895
std,3.468853,3.556378,5.176166,1.256371,1.301647,1.969705,0.240050,0.223591,0.319037
min,2.000000,3.000000,5.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,9.000000,9.000000,19.000000,1.000000,1.000000,2.000000,0.000000,0.000000,0.000000
50%,11.000000,12.000000,23.000000,2.000000,2.000000,4.000000,0.000000,0.000000,0.000000
75%,13.000000,14.000000,25.000000,3.000000,3.000000,5.000000,0.000000,0.000000,0.000000
max,24.000000,24.000000,38.000000,6.000000,6.000000,11.000000,2.000000,1.000000,2.000000

In [9]:
groupedRefs = df.groupby("Referee")
groupedRefs.head()

,Date,HomeTeam,AwayTeam,Referee,HomeFouls,AwayFouls,TotalFouls,HomeYellows,AwayYellows,TotalYellows,HomeReds,AwayReds,TotalReds
0,13/08/2016,Burnley,Swansea,J Moss,10,14,24,3,2,5,0,0,0
1,13/08/2016,Crystal Palace,West Brom,C Pawson,12,15,27,2,2,4,0,0,0
2,13/08/2016,Everton,Tottenham,M Atkinson,10,14,24,0,0,0,0,0,0
3,13/08/2016,Hull,Leicester,M Dean,8,17,25,2,2,4,0,0,0
4,13/08/2016,Man City,Sunderland,R Madley,11,14,25,1,2,3,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
308,08/04/2017,West Brom,Southampton,C Kavanagh,12,12,24,2,2,4,0,0,0
336,29/04/2017,Stoke,West Ham,L Probert,12,3,15,1,0,1,0,0,0
357,13/05/2017,Bournemouth,Burnley,L Probert,6,11,17,0,1,1,0,0,0
374,21/05/2017,Leicester,Bournemouth,l Mason,11,10,21,4,1,5,0,0,0
377,21/05/2017,Southampton,Stoke,L Probert,12,10,22,2,4,6,0,0,0

In [10]:
groupedRefs.describe()

              HomeFouls                                                       \
                  count       mean       std   min    25%   50%    75%   max
Referee
A Marriner         28.0  10.392857  3.832988   5.0   8.00   9.5  14.00  20.0
A Taylor           30.0  12.300000  3.228643   5.0  10.25  12.0  14.75  19.0
C Kavanagh          1.0  12.000000       NaN  12.0  12.00  12.0  12.00  12.0
C Pawson           24.0  11.916667  4.373007   2.0   9.75  12.0  15.00  21.0
G Scott             8.0  10.625000  3.248626   4.0   9.50  12.0  12.25  14.0
J Moss             30.0  11.600000  3.499754   5.0   9.00  12.0  14.00  20.0
K Friend           20.0  11.050000  3.940011   5.0   8.50  10.5  14.00  18.0
L Mason            19.0  10.263158  3.380370   5.0   8.00   9.0  13.00  17.0
L Probert           4.0  10.500000  3.000000   6.0  10.50  12.0  12.00  12.0
M Atkinson         27.0   9.851852  2.506970   5.0   8.50  10.0  11.50  14.0
M Clattenburg      22.0  11.090909  3.650298   5.0   8.00  11.5  13.75  18.0
M Dean             30.0  10.400000  3.499754   4.0   7.25  10.0  13.00  17.0
M Jones            18.0  12.722222  3.005985   8.0  11.00  12.5  14.00  20.0
M Oliver           33.0  10.818182  3.106994   5.0   8.00  11.0  13.00  19.0
N Swarbrick        24.0  10.125000  2.923852   5.0   8.75  10.0  11.25  16.0
P Tierney          10.0  10.900000  3.178050   5.0   9.25  11.5  13.00  15.0
R East             11.0  11.909091  3.477198   8.0   9.00  10.0  15.00  17.0
R Madley           30.0  11.733333  3.814070   5.0  10.00  11.0  12.00  24.0
S Attwell          10.0  10.100000  3.604010   3.0   7.50  11.0  12.75  14.0
l Mason             1.0  11.000000       NaN  11.0  11.00  11.0  11.00  11.0

              AwayFouls             ... AwayReds      TotalReds            \
                  count       mean  ...      75%  max     count      mean
Referee                             ...
A Marriner         28.0   9.857143  ...     0.00  1.0      28.0  0.071429
A Taylor           30.0  12.333333  ...     0.00  0.0      30.0  0.133333
C Kavanagh          1.0  12.000000  ...     0.00  0.0       1.0  0.000000
C Pawson           24.0  12.833333  ...     0.00  1.0      24.0  0.166667
G Scott             8.0  11.750000  ...     0.25  1.0       8.0  0.250000
J Moss             30.0  11.733333  ...     0.00  0.0      30.0  0.100000
K Friend           20.0  12.750000  ...     0.00  1.0      20.0  0.050000
L Mason            19.0  10.842105  ...     0.00  1.0      19.0  0.157895
L Probert           4.0   8.000000  ...     0.00  0.0       4.0  0.000000
M Atkinson         27.0  11.851852  ...     0.00  1.0      27.0  0.111111
M Clattenburg      22.0   9.954545  ...     0.00  1.0      22.0  0.136364
M Dean             30.0  12.100000  ...     0.00  1.0      30.0  0.166667
M Jones            18.0  12.333333  ...     0.00  0.0      18.0  0.055556
M Oliver           33.0  10.787879  ...     0.00  1.0      33.0  0.090909
N Swarbrick        24.0  11.708333  ...     0.00  1.0      24.0  0.041667
P Tierney          10.0  12.200000  ...     0.00  1.0      10.0  0.200000
R East             11.0  12.090909  ...     0.00  1.0      11.0  0.181818
R Madley           30.0  13.433333  ...     0.00  0.0      30.0  0.066667
S Attwell          10.0   9.600000  ...     0.00  0.0      10.0  0.000000
l Mason             1.0  10.000000  ...     0.00  0.0       1.0  0.000000


                    std  min  25%  50%   75%  max
Referee
A Marriner     0.262265  0.0  0.0  0.0  0.00  1.0
A Taylor       0.434172  0.0  0.0  0.0  0.00  2.0
C Kavanagh          NaN  0.0  0.0  0.0  0.00  0.0
C Pawson       0.380693  0.0  0.0  0.0  0.00  1.0
G Scott        0.462910  0.0  0.0  0.0  0.25  1.0
J Moss         0.305129  0.0  0.0  0.0  0.00  1.0
K Friend       0.223607  0.0  0.0  0.0  0.00  1.0
L Mason        0.374634  0.0  0.0  0.0  0.00  1.0
L Probert      0.000000  0.0  0.0  0.0  0.00  0.0
M Atkinson     0.320256  0.0  0.0  0.0  0.00  1.0
M Clattenburg  0.351250  0.0  0.0  0.0  0.00  1.0
M Dean         0.379049  0.0  0.0  0.0  0.00  1.0
M Jones        0.235702  0.0  0.0  0.0  0.00  1.0
M Oliver       0.291937  0.0  0.0  0.0  0.00  1.0
N Swarbrick    0.204124  0.0  0.0  0.0  0.00  1.0
P Tierney      0.421637  0.0  0.0  0.0  0.00  1.0
R East         0.404520  0.0  0.0  0.0  0.00  1.0
R Madley       0.253708  0.0  0.0  0.0  0.00  1.0
S Attwell      0.000000  0.0  0.0  0.0  0.00  0.0
l Mason             NaN  0.0  0.0  0.0  0.00  0.0

[20 rows x 72 columns]

In [11]:
groupedRefs.describe()['TotalYellows']

               count      mean       std  min   25%  50%   75%   max
Referee
A Marriner      28.0  3.464286  2.081348  0.0  1.75  4.0  5.00   7.0
A Taylor        30.0  3.966667  1.973677  0.0  3.00  4.0  5.00   8.0
C Kavanagh       1.0  4.000000       NaN  4.0  4.00  4.0  4.00   4.0
C Pawson        24.0  3.916667  2.339020  0.0  2.75  3.5  5.00  11.0
G Scott          8.0  2.625000  1.187735  1.0  2.00  2.5  3.00   5.0
J Moss          30.0  3.966667  2.008316  1.0  2.25  4.0  5.00   9.0
K Friend        20.0  4.700000  2.154555  1.0  3.00  4.5  6.00   9.0
L Mason         19.0  3.526316  2.412201  0.0  2.00  3.0  5.50   8.0
L Probert        4.0  3.000000  2.449490  1.0  1.00  2.5  4.50   6.0
M Atkinson      27.0  3.222222  2.241794  0.0  1.50  3.0  4.50   8.0
M Clattenburg   22.0  3.272727  1.608958  0.0  2.00  3.0  4.00   6.0
M Dean          30.0  3.666667  1.768173  1.0  2.00  3.0  5.00   7.0
M Jones         18.0  3.388889  2.173067  0.0  2.00  4.0  4.75   8.0
M Oliver        33.0  3.333333  1.947220  0.0  2.00  3.0  5.00   7.0
N Swarbrick     24.0  3.708333  1.398109  1.0  3.00  4.0  5.00   6.0
P Tierney       10.0  2.900000  1.286684  1.0  2.00  3.0  3.00   5.0
R East          11.0  3.272727  1.902152  0.0  2.00  3.0  5.00   6.0
R Madley        30.0  4.133333  1.814374  1.0  3.00  4.0  5.75   8.0
S Attwell       10.0  3.000000  1.943651  0.0  2.00  2.5  3.75   7.0
l Mason          1.0  5.000000       NaN  5.0  5.00  5.0  5.00   5.0

In [12]:
df[df["TotalYellows"]==11]

,Date,HomeTeam,AwayTeam,Referee,HomeFouls,AwayFouls,TotalFouls,HomeYellows,AwayYellows,TotalYellows,HomeReds,AwayReds,TotalReds
171,26/12/2016,Burnley,Middlesbrough,C Pawson,17,18,35,6,5,11,0,0,0

In [13]:
df[df["TotalFouls"]==38]

,Date,HomeTeam,AwayTeam,Referee,HomeFouls,AwayFouls,TotalFouls,HomeYellows,AwayYellows,TotalYellows,HomeReds,AwayReds,TotalReds
129,27/11/2016,Watford,Stoke,R Madley,24,14,38,3,0,3,1,0,1

In [14]:
groupedRefs.describe()["TotalReds"]

               count      mean       std  min  25%  50%   75%  max
Referee
A Marriner      28.0  0.071429  0.262265  0.0  0.0  0.0  0.00  1.0
A Taylor        30.0  0.133333  0.434172  0.0  0.0  0.0  0.00  2.0
C Kavanagh       1.0  0.000000       NaN  0.0  0.0  0.0  0.00  0.0
C Pawson        24.0  0.166667  0.380693  0.0  0.0  0.0  0.00  1.0
G Scott          8.0  0.250000  0.462910  0.0  0.0  0.0  0.25  1.0
J Moss          30.0  0.100000  0.305129  0.0  0.0  0.0  0.00  1.0
K Friend        20.0  0.050000  0.223607  0.0  0.0  0.0  0.00  1.0
L Mason         19.0  0.157895  0.374634  0.0  0.0  0.0  0.00  1.0
L Probert        4.0  0.000000  0.000000  0.0  0.0  0.0  0.00  0.0
M Atkinson      27.0  0.111111  0.320256  0.0  0.0  0.0  0.00  1.0
M Clattenburg   22.0  0.136364  0.351250  0.0  0.0  0.0  0.00  1.0
M Dean          30.0  0.166667  0.379049  0.0  0.0  0.0  0.00  1.0
M Jones         18.0  0.055556  0.235702  0.0  0.0  0.0  0.00  1.0
M Oliver        33.0  0.090909  0.291937  0.0  0.0  0.0  0.00  1.0
N Swarbrick     24.0  0.041667  0.204124  0.0  0.0  0.0  0.00  1.0
P Tierney       10.0  0.200000  0.421637  0.0  0.0  0.0  0.00  1.0
R East          11.0  0.181818  0.404520  0.0  0.0  0.0  0.00  1.0
R Madley        30.0  0.066667  0.253708  0.0  0.0  0.0  0.00  1.0
S Attwell       10.0  0.000000  0.000000  0.0  0.0  0.0  0.00  0.0
l Mason          1.0  0.000000       NaN  0.0  0.0  0.0  0.00  0.0

In [15]:
df[df["TotalReds"]==2]

,Date,HomeTeam,AwayTeam,Referee,HomeFouls,AwayFouls,TotalFouls,HomeYellows,AwayYellows,TotalYellows,HomeReds,AwayReds,TotalReds
131,03/12/2016,Man City,Chelsea,A Taylor,14,9,23,2,3,5,2,0,2

In [16]:
WCYears = np.arange(1930,2018,4)
WCYears = np.delete(WCYears,(3,4))

WCYears

array([1930, 1934, 1938, 1950, 1954, 1958, 1962, 1966, 1970, 1974, 1978,
       1982, 1986, 1990, 1994, 1998, 2002, 2006, 2010, 2014])

In [17]:
WCYears = [2002,2006,2010,2014]
WCHosts = ["Japan/Korea","Germany","South Africa","Brazil"]
WCWinners = ["Brazil","Italy","Spain","Germany"]

WCArray = np.array((WCYears, WCHosts, WCWinners))
WCArray

array([['2002', '2006', '2010', '2014'],
       ['Japan/Korea', 'Germany', 'South Africa', 'Brazil'],
       ['Brazil', 'Italy', 'Spain', 'Germany']], dtype='<U21')

In [18]:
#Finde the winner of the last World Cup

WCArray[2][-1]

'Germany'

In [19]:
WCYears = np.array([1966,1970,1974,1978])
WCTopScorers = np.array(["Eusebio","Muller","Lato","Kempes"])
WCGoals = np.array([9,10,7,6])

In [20]:
#Where does the top scorer score more than 8 goals?

WCTopScorers[WCGoals>8]

array(['Eusebio', 'Muller'], dtype='<U7')

In [21]:
PlayerList = ["Lewandowski","Haaland","Werner","Volland"]
SkillList=["Shooting","Passing","Heading"]

ScoresArray = np.random.randint(1,10,(4,3))
ScoresArray

array([[9, 2, 9],
       [9, 4, 9],
       [2, 9, 5],
       [6, 3, 6]])

In [22]:
df = pd.DataFrame(data=ScoresArray, index=PlayerList, columns=SkillList)
df

             Shooting  Passing  Heading
Lewandowski         9        2        9
Haaland             9        4        9
Werner              2        9        5
Volland             6        3        6

In [23]:
df["Shooting"]

Lewandowski    9
Haaland        9
Werner         2
Volland        6
Name: Shooting, dtype: int64

In [24]:
df.loc["Lewandowski"]

Shooting    9
Passing     2
Heading     9
Name: Lewandowski, dtype: int64

In [25]:
df.iloc[1:3]

         Shooting  Passing  Heading
Haaland         9        4        9
Werner          2        9        5

In [26]:
df["Pace"] = np.random.randint(1,10,4)
df

             Shooting  Passing  Heading  Pace
Lewandowski         9        2        9     2
Haaland             9        4        9     6
Werner              2        9        5     1
Volland             6        3        6     9

In [27]:
df = df.drop("Heading", axis=1)
df

             Shooting  Passing  Pace
Lewandowski         9        2     2
Haaland             9        4     6
Werner              2        9     1
Volland             6        3     9

In [28]:
df.loc["Piątek"] = (np.random.randint(1,10,3))
df

             Shooting  Passing  Pace
Lewandowski         9        2     2
Haaland             9        4     6
Werner              2        9     1
Volland             6        3     9
Piątek              8        5     3

In [29]:
df>5

             Shooting  Passing   Pace
Lewandowski      True    False  False
Haaland          True    False   True
Werner          False     True  False
Volland          True    False   True
Piątek           True    False  False

In [30]:
df[df["Shooting"]>5]

             Shooting  Passing  Pace
Lewandowski         9        2     2
Haaland             9        4     6
Volland             6        3     9
Piątek              8        5     3

In [31]:
df = pd.DataFrame({'Wage':[150000,123000,np.nan],
'GoalBonus':[4000,np.nan,np.nan],
'ImageRights':[50000,70000,100000]}, 
index=['Konda','Makho','Grey'],
columns=['Wage','GoalBonus','ImageRights'])

df

           Wage  GoalBonus  ImageRights
Konda  150000.0     4000.0        50000
Makho  123000.0        NaN        70000
Grey        NaN        NaN       100000

In [32]:
df.dropna(thresh=2)

           Wage  GoalBonus  ImageRights
Konda  150000.0     4000.0        50000
Makho  123000.0        NaN        70000

In [33]:
df.fillna(value=0)

           Wage  GoalBonus  ImageRights
Konda  150000.0     4000.0        50000
Makho  123000.0        0.0        70000
Grey        0.0        0.0       100000

In [34]:
df["Wage"].fillna(value=df['Wage'].mean())

Konda    150000.0
Makho    123000.0
Grey     136500.0
Name: Wage, dtype: float64

In [35]:
data = {'Opponent':
        ["Atletico Jave","Newtown FC", 
         "Bunton Town", "Fentborough Dynamo"],
       'Location':
        ["Home","Away","Away","Home"],
        'GoalsFor':
        [2,4,3,0],
        'GoalsAgainst':
        [4,0,2,2]}

Matches = pd.DataFrame(data)
Matches

             Opponent Location  GoalsFor  GoalsAgainst
0       Atletico Jave     Home         2             4
1          Newtown FC     Away         4             0
2         Bunton Town     Away         3             2
3  Fentborough Dynamo     Home         0             2

In [36]:
Matches.groupby("Location").describe()

         GoalsFor                                           GoalsAgainst       \
            count mean       std  min   25%  50%   75%  max        count mean
Location
Away          2.0  3.5  0.707107  3.0  3.25  3.5  3.75  4.0          2.0  1.0
Home          2.0  1.0  1.414214  0.0  0.50  1.0  1.50  2.0          2.0  3.0


               std  min  25%  50%  75%  max
Location
Away      1.414214  0.0  0.5  1.0  1.5  2.0
Home      1.414214  2.0  2.5  3.0  3.5  4.0

In [37]:
match1 = pd.DataFrame({'Opponent':['Selche FC'],
                      'GoalsFor':[1],
                       'GoalsAgainst':[1],
                       'Attendance':[53225]})

match2 = pd.DataFrame({'Opponent':['Sudaton FC'],
                      'GoalsFor':[3],
                       'GoalsAgainst':[0],
                       'Attendance':[53256]})

match3 = pd.DataFrame({'Opponent':['Ouestjambon United'],
                      'GoalsFor':[4],
                       'GoalsAgainst':[1],
                       'Attendance':[53225]})

match3

             Opponent  GoalsFor  GoalsAgainst  Attendance
0  Ouestjambon United         4             1       53225

In [38]:
AllMatches = pd.concat([match1,match2,match3])
AllMatches

             Opponent  GoalsFor  GoalsAgainst  Attendance
0           Selche FC         1             1       53225
0          Sudaton FC         3             0       53256
0  Ouestjambon United         4             1       53225

In [39]:
match1scorers = pd.DataFrame({'First':['Sally'],
                              'Last':['Billy'],
                            'Opponent':['Selche FC']})
                      
match2scorers = pd.DataFrame({'First':['Sally'],
                              'Last':['Pip'],
                             'Opponent':['Sudaton FC']})

match3scorers = pd.DataFrame({'First':['Sally'],
                             'Last':['Sally'],
                             'Opponent':['Ouestjambon United']})

AllScorers = pd.concat([match1scorers,match2scorers,match3scorers]) 
AllScorers

   First   Last            Opponent
0  Sally  Billy           Selche FC
0  Sally    Pip          Sudaton FC
0  Sally  Sally  Ouestjambon United

In [40]:
All = pd.merge(AllMatches,AllScorers)
All

             Opponent  GoalsFor  GoalsAgainst  Attendance  First   Last
0           Selche FC         1             1       53225  Sally  Billy
1          Sudaton FC         3             0       53256  Sally    Pip
2  Ouestjambon United         4             1       53225  Sally  Sally

In [41]:
data = pd.read_csv("Data Store/players_20.csv")
data.head()

,sofifa_id,player_url,short_name,long_name,age,dob,height_cm,weight_kg,nationality,club,...,lwb,ldm,cdm,rdm,rwb,lb,lcb,cb,rcb,rb
0,158023,https://sofifa.com/player/158023/lionel-messi/...,L. Messi,Lionel Andrés Messi Cuccittini,32,1987-06-24,170,72,Argentina,FC Barcelona,...,68+2,66+2,66+2,66+2,68+2,63+2,52+2,52+2,52+2,63+2
1,20801,https://sofifa.com/player/20801/c-ronaldo-dos-...,Cristiano Ronaldo,Cristiano Ronaldo dos Santos Aveiro,34,1985-02-05,187,83,Portugal,Juventus,...,65+3,61+3,61+3,61+3,65+3,61+3,53+3,53+3,53+3,61+3
2,190871,https://sofifa.com/player/190871/neymar-da-sil...,Neymar Jr,Neymar da Silva Santos Junior,27,1992-02-05,175,68,Brazil,Paris Saint-Germain,...,66+3,61+3,61+3,61+3,66+3,61+3,46+3,46+3,46+3,61+3
3,200389,https://sofifa.com/player/200389/jan-oblak/20/...,J. Oblak,Jan Oblak,26,1993-01-07,188,87,Slovenia,Atlético Madrid,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,183277,https://sofifa.com/player/183277/eden-hazard/2...,E. Hazard,Eden Hazard,28,1991-01-07,175,74,Belgium,Real Madrid,...,66+3,63+3,63+3,63+3,66+3,61+3,49+3,49+3,49+3,61+3

In [42]:
def club(teamName):
    return data[data["club"] == teamName][['short_name','wage_eur','value_eur','player_positions','overall','age']]

club("Borussia Dortmund").sort_values("wage_eur", ascending=False)

           short_name  wage_eur  value_eur player_positions  overall  age
37            M. Reus    170000   56000000      CAM, LM, ST       88   30
49         M. Hummels    130000   41000000               CB       87   30
102         A. Witsel    110000   31500000          CDM, CM       85   30
186      Paco Alcácer    105000   32000000               ST       83   25
270          M. Götze     98000   26000000      CF, CAM, CM       82   27
118         J. Brandt     94000   40500000      CAM, LM, RM       84   23
88           R. Bürki     92000   32000000               GK       85   28
281         T. Hazard     90000   26000000       RM, LM, CF       82   26
275         N. Schulz     82000   22500000      LWB, LM, LB       82   26
271        T. Delaney     82000   23000000          CDM, CM       82   27
357      R. Guerreiro     79000   21500000       LM, LB, CM       81   25
170         M. Akanji     77000   31000000               CB       83   23
382       L. Piszczek     76000    6000000               RB       81   34
446          J. Weigl     61000   17500000          CDM, CB       80   23
108         J. Sancho     61000   44500000           RM, LM       84   19
773         M. Dahoud     58000   14000000          CM, CDM       78   23
1516     M. Schmelzer     53000    5500000               LB       76   31
933           M. Hitz     49000    6500000               GK       78   31
585         A. Hakimi     48000   16000000           LB, RB       79   20
588        D. Zagadou     48000   16000000           CB, LB       79   20
1736          M. Wolf     43000    8000000       RB, RM, CM       75   24
1629        J. Larsen     41000   11000000               LM       75   20
10315  E. Oelschlägel      9000     550000               GK       65   23
11048      L. Balerdi      9000     925000               CB       64   20
14741       D. Wanner      7000     450000       LM, LB, LW       60   20
11044     Mateu Morey      6000     900000               RB       64   19
16421    P. Osterhage      5000     220000          CM, CDM       57   19
14666       T. Raschl      4000     425000              CDM       60   19
15903        A. Bakir      3000     260000       RM, LM, RW       58   18
15328     K. Bafounta      1000     325000               CM       59   17
15342     L. Unbehaun      1000     270000               GK       59   18

In [43]:
Burki = data[data["short_name"] == "R. Bürki"][['short_name','wage_eur','value_eur','player_positions','overall','age']]
Burki

   short_name  wage_eur  value_eur player_positions  overall  age
88   R. Bürki     92000   32000000               GK       85   28

In [44]:
Burki_wage = Burki["wage_eur"].item()
Burki_pos = Burki["player_positions"].item()
Burki_ovr = Burki["overall"].item()
Burki_age = Burki['age'].item()

In [46]:
longlist = data[data['player_positions'] == Burki_pos][['short_name','wage_eur','value_eur','player_positions','overall','age']]

removals = longlist[(longlist["overall"]<Burki_ovr) | (longlist["wage_eur"]>Burki_wage) | (longlist["age"]>Burki_age)].index
longlist.drop(removals , inplace=True)

longlist.sort_values("wage_eur")

       short_name  wage_eur  value_eur player_positions  overall  age
74  G. Donnarumma     34000   41500000               GK       85   20
86       A. Lopes     88000   33500000               GK       85   28
88       R. Bürki     92000   32000000               GK       85   28

In [47]:
def cheap_replacement(player_name):
    player = data[data["short_name"] == player_name][['short_name','wage_eur','value_eur','player_positions','overall','age']]

    wage = player["wage_eur"].item()
    pos = player["player_positions"].item()
    ovr = player["overall"].item()
    age = player['age'].item()

    longlist = data[data['player_positions'] == pos][['short_name','wage_eur','value_eur','player_positions','overall','age']]

    removals = longlist[(longlist["overall"]<ovr) | (longlist["wage_eur"]>wage) | (longlist["age"]>age) | (longlist["short_name"] == player_name)].index
    longlist.drop(removals , inplace=True)

    return longlist.sort_values("wage_eur")

cheap_replacement("M. Schmelzer")

           short_name  wage_eur  value_eur player_positions  overall  age
549           Ismaily      1000   12000000               LB       80   29
1585         Sequeira     14000    6500000               LB       76   28
1012         Reguilón     14000   11500000               LB       77   22
174          Grimaldo     18000   29500000               LB       83   23
1336     Rubén Duarte     18000    9000000               LB       76   23
1578          E. Mena     19000    6000000               LB       76   30
1235            Nacho     20000    7000000               LB       77   30
1329  L. Augustinsson     23000    9000000               LB       76   25
1324     T. Hernández     23000    9500000               LB       76   21
124       Alex Telles     23000   33000000               LB       84   26
778      Aarón Martín     24000   12500000               LB       78   22
972          F. Fabra     25000    9000000               LB       78   28
1108  M. Plattenhardt     26000    9000000               LB       77   27
705              Cote     27000   10500000               LB       79   29
692    Yuri Berchiche     27000   10500000               LB       79   29
1411   Alberto Moreno     27000    8000000               LB       76   26
266     N. Tagliafico     27000   23500000               LB       82   26
1362        C. Taylor     29000    8500000               LB       76   25
1013       Renan Lodi     31000   12000000               LB       77   21
941       Jaume Costa     33000    7500000               LB       78   31
339              Gayà     35000   21000000               LB       81   24
1381          Dalbert     45000    8500000               LB       76   25
1504   P. van Aanholt     46000    6500000               LB       76   28
1084          Wendell     47000   10000000               LB       77   25
1261       K. Tierney     52000   11000000               LB       76   22
1426      H. Kaldırım     53000    6500000               LB       76   29
483    M. Halstenberg     53000   14500000               LB       80   27

In [48]:
df = pd.read_csv("Data Store/Results.csv")

df.head()

         Date        HomeTeam    AwayTeam  FTHG  FTAG     Referee
0  13/08/2016         Burnley     Swansea     0     1      J Moss
1  13/08/2016  Crystal Palace   West Brom     0     1    C Pawson
2  13/08/2016         Everton   Tottenham     1     1  M Atkinson
3  13/08/2016            Hull   Leicester     2     1      M Dean
4  13/08/2016        Man City  Sunderland     2     1    R Madley

In [49]:

print(df["HomeTeam"].unique())

['Burnley' 'Crystal Palace' 'Everton' 'Hull' 'Man City' 'Middlesbrough'
 'Southampton' 'Arsenal' 'Bournemouth' 'Chelsea' 'Man United' 'Leicester'
 'Stoke' 'Swansea' 'Tottenham' 'Watford' 'West Brom' 'Sunderland'
 'West Ham' 'Liverpool']

In [50]:
del df["Referee"]

df.head()

         Date        HomeTeam    AwayTeam  FTHG  FTAG
0  13/08/2016         Burnley     Swansea     0     1
1  13/08/2016  Crystal Palace   West Brom     0     1
2  13/08/2016         Everton   Tottenham     1     1
3  13/08/2016            Hull   Leicester     2     1
4  13/08/2016        Man City  Sunderland     2     1

In [51]:
df['Result'] = df["FTHG"] - df["FTAG"]

def find_winner(value):
    if value>0:
        return("Home")
    elif value == 0:
        return("Tie")
    else:
        return("Away")

df['WhoWin'] = df['Result'].apply(find_winner)

df.head()

         Date        HomeTeam    AwayTeam  FTHG  FTAG  Result WhoWin
0  13/08/2016         Burnley     Swansea     0     1      -1   Away
1  13/08/2016  Crystal Palace   West Brom     0     1      -1   Away
2  13/08/2016         Everton   Tottenham     1     1       0    Tie
3  13/08/2016            Hull   Leicester     2     1       1   Home
4  13/08/2016        Man City  Sunderland     2     1       1   Home

In [52]:
df.groupby("WhoWin").mean()

            FTHG      FTAG    Result
WhoWin
Away    0.568807  2.504587 -1.935780
Home    2.497326  0.566845  1.930481
Tie     0.928571  0.928571  0.000000

In [53]:
df['TotalGoals'] = df['FTHG'] + df['FTAG']

df.groupby("HomeTeam").mean()["TotalGoals"].sort_values(ascending=False)

HomeTeam
Chelsea           3.789474
Bournemouth       3.368421
Liverpool         3.315789
Hull              3.315789
Swansea           3.210526
Everton           3.052632
Tottenham         2.947368
Leicester         2.947368
Arsenal           2.894737
Man City          2.842105
Watford           2.842105
Sunderland        2.631579
West Ham          2.631579
West Brom         2.578947
Crystal Palace    2.578947
Stoke             2.526316
Burnley           2.421053
Middlesbrough     2.105263
Man United        2.000000
Southampton       2.000000
Name: TotalGoals, dtype: float64

In [54]:
df.groupby("AwayTeam").mean()["TotalGoals"].sort_values(ascending=False)

AwayTeam
Arsenal           3.473684
Man City          3.421053
Crystal Palace    3.368421
West Ham          3.210526
Bournemouth       3.052632
Liverpool         3.000000
Tottenham         2.947368
Leicester         2.894737
Hull              2.842105
Swansea           2.842105
Watford           2.842105
Southampton       2.684211
Stoke             2.578947
Everton           2.526316
Sunderland        2.526316
Burnley           2.526316
Chelsea           2.421053
Man United        2.368421
West Brom         2.368421
Middlesbrough     2.105263
Name: TotalGoals, dtype: float64